examples/swirlDuctCoarse/0/B
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      B;
}
dimensions      [1 0 -2 0 0 -1 0];

internalField   uniform (0 0 -10);

boundaryField
{
    inlet    { type zeroGradient; }
    outlet   { type zeroGradient; }
    wall { type fixedValue; value uniform (0 0 -10); }
}
