examples/swirlDuctCoarse/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\    /    A nd         | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 287;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 287;
    }

    outlet
    {
        type            zeroGradient;
    }







    wall
    {
        type            omegaWallFunction;
        value           uniform 287;
    }
}

// ************************************************************************* //
