examples/swirlDuctCoarse/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;


rho             rho [ 1 -3 0 0 0 0 0 ] 1e3;

nu              nu [ 0 2 -1 0 0 0 0 ] 4.1792e-04;

mu              mu [ 1 1 -2 0 0 -2 0 ] 1.2566e-06;

sigma           sigma [ -1 -3 3 0 0 2 0 ] 7.09e1;


// ************************************************************************* //
