examples/swirlDuctCoarse/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  6                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Integration/smoke test, NOT a verification case: the short physical time is
// deliberate, it only exercises the turbulent + spanwise-field code path.

application     mhdturbFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

// 250 steps at dt = 2e-5 s
endTime         0.005;

deltaT          2e-05;

writeControl    timeStep;

writeInterval   50;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.5;

maxDeltaT       2e-05;

functions
{
    // Residual history (p, U, B, pB and the k-omega SST fields)
    residuals
    {
        type            residuals;
        libs            ( "libutilityFunctionObjects.so" );
        fields          ( p U B pB k omega );
        writeControl    timeStep;
        writeInterval   1;
    }
}

// ************************************************************************* //
